ERP.belugaerp/src/Documents/ПервичныйДокумент/ПервичныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПервичныйДокумент</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

ERP.belugaerp/src/Enums/ТипыПервичныхДокументов/ТипыПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыПервичныхДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПриобретениеУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ПервичныйДокумент/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
	
&НаСервере
&После("ПриСозданииНаСервере")
Процедура бг_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьЭлементФормыПунктНазначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&После("ТипПервичногоДокументаПриИзмененииСервер")
Процедура бг_ТипПервичногоДокументаПриИзмененииСервер()
	
	бг_УстановитьВидимостьПунктаНазначения();
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьЭлементФормыПунктНазначения()
	
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтаФорма,
		"бг_ПунктНазначения",
		Элементы.ГруппаШапкаЛево,
		"Объект.бг_ПунктНазначения",
		"ПолеФормы",
		Элементы.ГруппаСуммаДокумента);
	
	бг_УстановитьВидимостьПунктаНазначения();
	
КонецПроцедуры

&НаСервере
Процедура бг_УстановитьВидимостьПунктаНазначения()
	
	Элементы.бг_ПунктНазначения.Видимость = Объект.ТипПервичногоДокумента =
		ПредопределенноеЗначение("Перечисление.ТипыПервичныхДокументов.РеализацияКлиенту");
	
КонецПроцедуры

#КонецОбласти
